
                    # Функция count_lines принимает имя файла (name) и считает количество строк в файле
def count_lines(name):
                       # Открывает файл с указанным именем в режиме чтения
    with open(name) as text:
                       # Читаем все строки файла в список
        lines = text.readlines()
                       # Возвращаем длину списка строк, которая равна количеству строк в файле
        return len(lines)

                     # Функция count_chars принимает имя файла (name) и считает количество символов в файле
def count_chars(name):
                     # Открываем файл с указанным именем в режиме чтения
    with open(name) as text:
                     # Читаем весь текст файла как одну строку
        read = text.read()
                    # Возвращаем длину строки, которая равна количеству символов в файле
        return len(read)

                   # Функция test принимает имя файла (name) и использует другие функции для подсчёта строк и символов
def test(name):
                 # Вызываем функцию count_lines, чтобы получить количество строк в файле
    line = count_lines(name)
                 # Вызываем функцию count_chars, чтобы получить количество символов в файле
    chars = count_chars(name)
                 # Возвращаем количество строк и символов  (line, chars)
    return line, chars



