import requests  # Импортируем библиотеку requests, чтобы отправлять HTTP-запросы.

# Функция для получения и отображения погоды в заданном городе
def get_weather(city):
    api_key = "65d5795bc58348b198e090066297a5e6"
    base_url = "http://api.openweathermap.org/data/2.5/weather?"  # Базовый URL для API запроса.
    complete_url = base_url + "appid=" + api_key + "&q=" + city  # Формируем полный URL для запроса, добавляя ключ API и название города.
    response = requests.get(complete_url)  # Отправляем HTTP-запрос на сервер и сохраняем ответ в переменную response.
    x = response.json()  # Преобразуем ответ в формате JSON в Python-объект (словарь).

    # Проверяем, есть ли ошибка в ответе (например, город не найден).
    if x["cod"] != "404":
        if "main" in x:  # Проверяем наличие ключа 'main' в ответе
            y = x["main"]  # Извлекаем раздел "main", содержащий основные данные о погоде.
            current_temperature = y["temp"] - 273.15  # Температура из API приходит в Кельвинах, переводим в Цельсии.
            current_pressure = y["pressure"]  # Извлекаем атмосферное давление (в гектопаскалях).
            current_humidiy = y["humidity"]  # Извлекаем влажность воздуха (в процентах).
            z = x["weather"]  # Извлекаем раздел "weather", содержащий описание погоды.
            weather_description = z[0]["description"]  # Получаем текстовое описание текущей погоды.

            # Выводим полученные данные на экран.
            print("Температура в градусах Цельсия =", current_temperature)
            print("Атмосферное давление (в hPa) =", current_pressure)
            print("Влажность (%) =", current_humidiy)
            print("Описание погоды =", weather_description)
        else:
            # Сообщаем, что ключ 'main' отсутствует в ответе
            print("Ключ 'main' отсутствует в ответе API.")
    else:
        # Если код ответа равен "404", значит, город не найден.
        print("Город не найден")


# Основной блок программы, который выполняется при запуске скрипта.
if __name__ == "__main__":
    city = input("Введите название города: ")  # Запрашиваем у пользователя название города.
    get_weather(city)  # Вызываем функцию get_weather с введённым пользователем городом.

"""
Объяснение:
Импорт библиотек: 
Импортируем необходимые библиотеки для работы с HTTP-запросами и JSON.

Функция get_weather:
Принимает название города в качестве аргумента.
Формирует URL запроса к API OpenWeatherMap.
Отправляет GET запрос и получает ответ в формате JSON.
Парсит полученные данные и извлекает необходимые значения (температура, давление, влажность, описание погоды).
Выводит результат в консоль.

Основной блок:
Запрашивает у пользователя название города.
Вызывает функцию get_weather для получения информации о погоде.

7. Запуск и расширение:
Сохранить код в файл с расширением .py (например, weather.py).
Запустите его из командной строки.
"""