def make_country (name, capital):
    dict_country = {name : capital}
    print(dict_country)
make_country('Ukraine','Kiev')

"""
Создание функции:

Начни с определения функции, используй ключевое слово. 
Функция должна принимать два параметра: название страны и столицу.

Создание словаря внутри функции:

Внутри функции нужно создать словарь, который будет хранить название страны и её столицу.
Используя два ключа: 'name' и 'capital'
.
Печать значений словаря:

После создания словаря нужно вывести его значения.
Тестирование функции:

После завершения функции, вызови её с реальными значениями,чтобы проверить, как всё работает.
"""


