list1 = []
i = 1
while i <= 100:
    list1.append(i)
    i += 1
common_list = []
j = 0
while j < len(list1):
    if list1[j] % 7 == 0 and list1[j]  % 5 != 0:
        common_list.append(list1[j])
    j += 1
print('General list:' , common_list)

"""Составьте список, содержащий все целые числа от 1 до 100, 
затем найдите все целые числа из списка, которые кратны 7, но не кратны 5, и сохраните их 
в отдельном списке. 
Наконец, выведите список на печать.

Шаг 1: Создать список с числами от 1 до 100
Инициализируем пустой список, который назовем list1.
Задаем переменную, например i, которая будет начальным числом в диапазоне, то есть i = 1.
Используем цикл while для добавления чисел в list1. 
Пока значение переменной i не станет больше 100, добавляем текущее значение i в list1.
После добавления каждого числа увеличиваем значение i на 1, чтобы перейти к следующему числу.

Шаг 2: Найти числа, которые кратны 7, но не кратны 5
Инициализируем еще один пустой список, который назовем common_list.
 В него будем добавлять числа, удовлетворяющие условиям задачи.
Создаем еще одну переменную, например j, которая будет использоваться для отслеживания 
индекса текущего числа в списке list1.
Снова используем цикл while, чтобы пройти по всем элементам списка list1.
На каждой итерации проверяем, делится ли текущее число на 7 (без остатка) 
и не делится на 5 (то есть остаток от деления на 5 не равен нулю).
Если оба условия выполняются, добавляем это число в список common_list.
После проверки каждого числа увеличиваем значение j на 1, 
чтобы перейти к следующему элементу списка list1.

Шаг 3: Вывести результат
После завершения второго цикла, в списке common_list окажутся все числа от 1 до 100, 
которые делятся на 7, но не делятся на 5.
Наконец, выводим содержимое common_list, чтобы увидеть результат.
"""